encryption = {'б':'а', 'в':'б', 'г':'в','д':'г', 'е':'д', 'ё':'е',
              'ж':'ё', 'з':'ж', 'и':'з','й':'и', 'к':'й', 'л':'к',
              'м':'л', 'н':'м', 'о':'н','п':'о', 'р':'п', 'с':'р',
              'т':'с', 'у':'т', 'ф':'у','х':'ф', 'ц':'ъ', 'ч':'ц',
              'ш':'ч', 'щ':'ш', 'ъ':'щ','ы':'ъ', 'ь':'ы', 'э':'ь',
              'ю':'э', 'я':'ю', 'а':'я','О':'1', 'Д':'2', 'Т':'3',
              'Ч':'4', 'П':'5', 'Ш':'6','С':'7', 'В':'8', 'Е':'9',
              'Я':'0', '/':'.', '_':'!',',':' ', ' ':',', '^':':',
              '*':'\n'}

f = open("encrypt_mess.txt", "r")
for symbol in f.read():
    if symbol in encryption:
        symbol=encryption[symbol]
    print(symbol, end="")
f.close()
